{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "activation": "linear", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "dtype": "float32", "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"filters": 64, "activation": "linear", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "dtype": "float32", "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 1024, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_5", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 10, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_6", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_8", "trainable": true}}], "backend": "tensorflow"}